* データの削除とオートインクリメントの値の変更（MySQL）
  :LOGBOOK:
  CLOCK: [2020-08-16 日 10:39]--[2020-08-16 日 11:02] =>  0:23
  :END:

:CATEGORIES: MySQL

〉〉〉：Emacs： 2020-08-16（日曜日）10：39　 〉〉〉

　まず，誤って登録したデータを削除し正常化させた結果になります。

```
mysql> select id,user from tw_user_tweet ORDER BY id DESC limit 20;
    +--------+-----------------+
    | id     | user            |
    +--------+-----------------+
    | 483788 | fukazawas       |
    | 483787 | fukazawas       |
    | 483786 | motoken_tw      |
    | 483785 | motoken_tw      |
    | 483784 | Miyako_Koji     |
    | 483783 | mackckckck      |
    | 483782 | fukazawas       |
    | 483781 | fukazawas       |
    | 483780 | fukazawas       |
    | 483779 | fukazawas       |
    | 483778 | fukazawas       |
    | 483777 | kumaemon9       |
    | 483776 | k_sawmen        |
    | 483775 | guitar_ben      |
    | 483774 | mototakiryu     |
    | 483773 | todateyoshiyuki |
    | 483772 | todateyoshiyuki |
    | 483771 | todateyoshiyuki |
    | 483770 | kurodalawoffice |
    | 483769 | hirono_hideki   |
    +--------+-----------------+
    20 rows in set (0.00 sec)
```

　テーブルの状態を確認。

mysql> show table status like 'tw_user_tweet';

　データの削除にともなうオートインクリメントの値を変更。

mysql> ALTER TABLE tw_user_tweet AUTO_INCREMENT=483785;

　TwitterAPIのスクリプトで，「:tweet_mode =>"extended"」というオプションを指定したところ，他のスクリプトではうまく行っていたのに，指定したユーザではないものがデータベースに入ってしまいました。原因は，「 :page => "#{tw_offset}"」を付けていなかったことでした。

　誤った投稿の削除です。

mysql> delete from tw_user_tweet where id >= 483785;

〈〈〈：Emacs： 2020-08-16（日曜日）11：02 　〈〈〈

* オプションを追加することで，TwitterAPIでツイートの全文が取得できるようになった
  :LOGBOOK:
  CLOCK: [2020-08-16 日 11:08]--[2020-08-16 日 11:39] =>  0:31
  :END:

:CATEGORIES: TwitterAPI

〉〉〉：Emacs： 2020-08-16（日曜日）11：08　 〉〉〉

　昨夜，同じ内容のツイートを連投し，朝になってそのツイートの内容をコピペで使おうと思ったのですが，全文の取得が出来ず末尾のカットとなっていました。これは前からあった問題ですが，ツイートが妙に短く見えたので，これはどうにかしたいと調べ始めました。

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜hirono_hideki（奉納＼さらば弁護士鉄道・泥棒神社の物語） 日時：2020-08-16 11:12／2020/08/16 08:30 URL： https://twitter.com/kk_hirono/status/1294819321969905664 https://twitter.com/hirono_hideki/status/1294778604123910145  

> Twitter APIで取得したつぶやきが「truncated=true」で切れてしまう！ - やったこと https://t.co/BsG2bmo8a5  

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜hirono_hideki（奉納＼さらば弁護士鉄道・泥棒神社の物語） 日時：2020-08-16 11:12／2020/08/16 08:23 URL： https://twitter.com/kk_hirono/status/1294819351728553984 https://twitter.com/hirono_hideki/status/1294776677998817280  

> Twitter の gem で 140 文字制限の拡張により正しくツイート情報が取得できない場合（末尾が切れる） - 約束の地 https://t.co/Ob2gn86f8N  

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜hirono_hideki（奉納＼さらば弁護士鉄道・泥棒神社の物語） 日時：2020-08-16 11:12／2020/08/16 08:16 URL： https://twitter.com/kk_hirono/status/1294819371861254146 https://twitter.com/hirono_hideki/status/1294774893121159168  

> Python - ツイートを全文取得する方法｜teratail https://t.co/hVbTW8cXEH  

　次の3箇所，スクリプトの修正をしました。中には変数が混じっています。

```
client.user_timeline("#{tw_user}", {:count => "#{tw_count.to_i}", :page => "#{tw_offset}", :tweet_mode =>"extended"}).reverse_each do |tweet|

tweet_text = tweet.full_text.gsub('&lt;', '<').gsub('&gt;', '>')

org_tweet = tweet.retweeted_status.full_text
```

　次が，修正前のものと修正後のものになります。どちらもコマンドの実行結果をいったんファイルに保存し，それを使っっています。

```
(py37_env) a66@a66-XTe:~$ cat k|grep -E '^@JFBAsns'
@JFBAsns - 797：2020-08-15_23:16:46 ＊ 日本弁護士連合会（日弁連）@JFBAsns，第二東京弁護士会@niben_netに伝える，「戦没者に感謝って意味わからんよな。飢え死にしてくれてありがとうっ… https://t.co/UEyqeGGrvf
(py37_env) a66@a66-XTe:~$ cat k2|grep -E '^@JFBAsns'
@JFBAsns - 797：2020-08-15_23:16:46 ＊ 日本弁護士連合会（日弁連）@JFBAsns，第二東京弁護士会@niben_netに伝える，「戦没者に感謝って意味わからんよな。飢え死にしてくれてありがとうって？」という深澤諭史弁護士のリツイート https://t.co/UY6YvmCpDS
```

　長い間，悩みの種だったTwitterAPIでツイートの全文が取得できない問題でしたが，8月15日の昨夜，日弁連（日本弁護士会）に送ったメッセージがきっかけで，解決することができました。これで活用の幅も広がります。

〈〈〈：Emacs： 2020-08-16（日曜日）11：39 　〈〈〈

* 富田林警察署被疑者逃走事件について，「ネット上では，勘違いから弁護人を非難する言説があるようです。」という深澤諭史弁護士の2018年8月21日付けのブログ記事
  :LOGBOOK:
  CLOCK: [2020-08-16 日 12:10]--[2020-08-16 日 17:05] =>  4:55
  :END:

:CATEGORIES: 深澤諭史弁護士,警察

〉〉〉：Emacs： 2020-08-16（日曜日）12：10　 〉〉〉

　深澤諭史弁護士の発言の中でも特に印象に残るもので，本件告発事件において，石川県警察との関わりを持つ上に置いても，非常に考えさせられたもの，別の言い方をすると，それだけ大きなマイナス要因の影響を受けた，ネット上の実名弁護士の発言になります。

　なお，さきほど深澤諭史弁護士のタイムラインで，私に対する返礼のようなツイートを見かけています。今の段階で直接言及することはないので，ツイートのご紹介にとどめておきます。先にリツイートを１つ見かけていて，その引用リツイートとなっています。

@fukazawas ===> You have been blocked from retweeting this user's tweets at their request.  
▷▷▷　次のツイートのアカウント（@fukazawas）は，@kk_hironoをブロックしています。リツイートできませんでした。 ▷▷▷  

- TW fukazawas（深澤諭史） 日時：2020/08/16 11:17 URL： https://twitter.com/fukazawas/status/1294820435092111361  

> 誰も相手していない（というかクオリティフィルタで自動非表示になっている）のに，ひたすら法クラに攻撃的なリプライを繰り返している人が稀にいますが，そういうの見かけてＴＬを見ると，どうしてこうなっちゃったんだろうか，少し気の毒に思うこ… https://t.co/ssMgxHixcs  

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜galaxy_idol02（レーティア） 日時：2020-08-16 12:19／2020/08/16 01:04 URL： https://twitter.com/kk_hirono/status/1294836028792946688 https://twitter.com/galaxy_idol02/status/1294666401324531714  

> 頭がおかしい垢に対しては，「かわいそうに頭がおかしいんだ。なぜ頭がおかしいのだろう，頭ががおかしくならずにはいられなかったのだろうか」といった感じで見れば心穏やかにいられます  

@fukazawas ===> You have been blocked from retweeting this user's tweets at their request.  
▷▷▷　次のツイートのアカウント（@fukazawas）は，@kk_hironoをブロックしています。リツイートできませんでした。 ▷▷▷  

- TW fukazawas（深澤諭史） 日時：2020/08/16 11:30 URL： https://twitter.com/fukazawas/status/1294823843119284224  

> １９３０年代ナチスドイツ「青い馬などこの世にいるわけがない。」  
> ２０２０年代日本「こんな背が低いのに胸が大きい女性がこの世にいるわけがない。」  
> （・∀・）（＾ω＾）？ https://t.co/J8UElIiYuu  

　もう一つ違ったスクリプトの修正をしていました。上記はテスト用に使ったツイートの投稿になります。前にツイートの全文を取得できなかったものを修正したスクリプトでやり直します。

@fukazawas ===> You have been blocked from retweeting this user's tweets at their request.  
▷▷▷　次のツイートのアカウント（@fukazawas）は，@kk_hironoをブロックしています。リツイートできませんでした。 ▷▷▷  

- TW fukazawas（深澤諭史） 日時：2020/08/16 11:17 URL： https://twitter.com/fukazawas/status/1294820435092111361  

> 誰も相手していない（というかクオリティフィルタで自動非表示になっている）のに，ひたすら法クラに攻撃的なリプライを繰り返している人が稀にいますが，そういうの見かけてＴＬを見ると，どうしてこうなっちゃったんだろうか，少し気の毒に思うことありますね。  
> （・∀・；） https://t.co/xt9FHFi6EB  

　時刻は12時51分です。台所で，フライパンに干物のカレイを焼き始めました。昨夜はご飯を1合炊いたまま食べることなく，そのまま保温状態が続いているのですが，21時から始まったNHKの番組がとても考えさせられる内容で，それが日弁連へのメッセージにもつながりました。

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜hirono_hideki（奉納＼さらば弁護士鉄道・泥棒神社の物語） 日時：2020-08-16 12:56／2020/08/15 21:02 URL： https://twitter.com/kk_hirono/status/1294845550253154306 https://twitter.com/hirono_hideki/status/1294605290952724482  

> NHKスペシャル「忘れられた戦後補償」[字]     8/15 (土) 21:00 ～ 22:00 （60分） この時間帯の番組表      ＮＨＫ総合１・金沢(Ch.1)     ドキュメンタリー／教養 - 社会・時事 , ドキュメンタリー／教養 - ドキュメンタリー全般 , ニュース／報道 - 報道特番 https://t.co/zxXRTWmS2I  

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜hirono_hideki（奉納＼さらば弁護士鉄道・泥棒神社の物語） 日時：2020-08-16 12:56／2020/08/15 21:04 URL： https://twitter.com/kk_hirono/status/1294845559879081984 https://twitter.com/hirono_hideki/status/1294605975723286535  

> NHKスペシャル「忘れられた戦後補償」[字] - Gガイド.テレビ王国 https://t.co/zxXRTWmS2I 国家総動員体制で遂行された日本の戦争。しかし、80万人が犠牲となった民間人は補償の対象から外され続けてきた。国家の戦争責任とは何なのか、膨大な資料から検証する。  

　タイムラインをみて思い出したのですが，昨夜は銭湯の浴場から上がったタイミングで，世界一受けたい授業でゴッホをみていました。世界的に有名が画家なので名前と作品の少しは知っていましたが，番組で紹介されていた人生は，知らないことばかりでした。

　生前はほとんど絵が売れなかったということで，これは少し聞いていたように思ったのですが，今考えると著書の売れ行きが好調で在庫切れが多いという深澤諭史弁護士とは，対照的です。

　ゴッホがピストル自殺をしたというのも知らなかったと思いますが，経済的にどん底状態で，弟に負担を掛けたくないというのが自殺の理由と紹介されていました。また，精神を病んで療養所に入っていたというのも意外でしたが，その辺りもニーチェに似ています。

　さて，次が深澤諭史弁護士のブログ記事になります。最初に初めの少しの部分だけ引用します。これだけでもご紹介としては十分すぎる気もします。

```
接見室から逃亡した事件が話題になっています。いつもの話ですが，ネット上では，勘違いから弁護人を非難する言説があるようです。そこで，誤解の解消のため，簡単に解説をしたいと思います。

［source：］接見室の構造と逃亡事件 ： 弁護士 深澤諭史のブログ http://xn--zqs94lv37b.club/archives/11404508.html
```

　「接見室から逃亡した事件が話題になっています。いつもの話ですが，ネット上では，勘違いから弁護人を非難する言説があるようです。そこで，誤解の解消のため，簡単に解説をしたいと思います。」という冒頭の部分だけを上記に引用しました。

　「このあたり，実際に弁護人（となろうとする者）としてやってみないと，イメージしにくいかと思います。ですが，あまりに誤解に基づいて弁護人を非難する向き（これは弁護士の仕事全般にいえますが）があるので，簡単に解説した次第です。」が最後の締めくくり部分です。

　時刻は13:59です。しばらくスマホでツイートを行い。あとでファイルに読み込みます。

　面会室というより警察署の構造になりますが、面会室は警察署の二階以上で、警察官が24時間集まり受け付けをする場所を通るのではないかと思います。予定より接見が早く終わったのであれば、他の警察官にでも一声かけるのが、社会人の常識で、信頼の原則ではないかと思います。

　時刻は14時11分です。2つツイートするのにずいぶんと時間が掛かったようです。スマホのフリック入力の練習でもあるのですが，家にクーラーがないので，スマホだとクーラーのある場所で作業が出来ます。今日も割合暑さはましなのですが，Twitterのトレンドで，浜松40度と見かけました。

　今年は今のところ家にいて，汗が吹き出るような暑さはありません。例年，お盆をすぎると夜は肌寒くなることがあるぐらいなので，余程の気候変動がないかぎり，体調の悪化につながるような暑さの山場は超えたと安堵をしています。

　この富田林警察署の被疑者逃走事件ですが，テレビでも沢山の報道がありました。ネットの情報も多かったですが，最後まで接見をした弁護士の情報を見ることはありませんでした。また，この刑事裁判もずいぶん情報が少ないようで，テレビでは全く見ていないと思います。

　前に，新型コロナウィルスで判決が延期になったとか，判決が複数で1つの判決が出たというニュースをネットで見ていましたが，話題になるような感じでも，関心を持たれている様子でもなさそうか感じでした。

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜livedoornews（ライブドアニュース） 日時：2020-08-16 14:22／2020/07/07 11:23 URL： https://twitter.com/kk_hirono/status/1294867094924701697 https://twitter.com/livedoornews/status/1280326609090703360  

> 【行方追う】障害者施設に入所の少年逃走、刃物で職員脅す 大阪・富田林 https://t.co/D0mo6A1cGZ  知的障害者支援施設に入所していた17歳少年が、男性職員を刃物で脅した上、ビニールテープで縛ってマスターキーを奪い逃走した。警察が少年の行方を追っている。  

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜Sankei_news（産経ニュース） 日時：2020-08-16 14:22／2020/07/03 14:16 URL： https://twitter.com/kk_hirono/status/1294867167452655616 https://twitter.com/Sankei_news/status/1278920441428504576  

> 富田林署逃走の樋田被告に懲役１７年　大阪地裁堺支部で判決 https://t.co/XKU57BwPBC  被告は加重逃走や窃盗など計２１件で起訴され、うち１８件は裁判官のみで審理。５月に部分判決があり、地裁堺支部は加重逃走罪など１７件を有罪、窃盗１件を無罪とした。  

富田林　逃走 - Twitter検索 / Twitter https://t.co/kPhgbCC45K

```
大阪府警富田林署から逃走したとする加重逃走罪などに問われた樋田（ひだ）淳也被告（３２）の裁判員裁判の判決公判が３日、大阪地裁堺支部で開かれ、安永武央裁判長は懲役１７年（求刑懲役１８年）を言い渡した。

　被告は加重逃走や窃盗など計２１件で起訴され、このうち１８件は裁判官のみで審理。５月に部分判決があり、地裁堺支部は加重逃走罪など１７件を有罪、窃盗１件を無罪とした。強盗致傷など３件は裁判員裁判として審理された。

［source：］富田林署逃走の樋田被告に懲役１７年　大阪地裁堺支部で判決 - 産経ニュース https://www.sankei.com/west/news/200703/wst2007030021-n1.html
```

　加重逃走罪というのは法定刑の上限がずいぶん低かったと思います。部分判決というのも今回始めてみましたが，どうも通常の刑事裁判と，裁判員裁判の２つに分離されたようです。強盗致傷などとありますが，逃走時の報道では強姦事件が強調されていたように思います。この記事にはないようです。

```
樋田容疑者は５月に盗んだバイクを保管していたとして現行犯逮捕され、富田林署で勾留中だった。６月には大阪市内で女性からかばんを奪い、府内のマンションで別の女性に乱暴したなどとして強制性交、窃盗、住居侵入の疑いで逮捕・起訴。その後、別の強盗致傷罪で追起訴、今月８日に４回目の逮捕となった。

［source：］富田林署から逃走した強姦魔「懲役２５年以上」も　大阪府警大失態…接見室に隙間、ブザーの電池抜き取り、防犯カメラも不鮮明 （2/2ページ） - zakzak https://www.zakzak.co.jp/soc/news/180815/soc1808150008-n2.html
```

　上記の記事は2018年8月15日となっているので，逃走があった3日後の記事になります。この時点で見出しに「懲役２５年以上」というのは，先走った気がします。加重逃走罪などで，という記事の内容で懲役17年というのも重く感じたところでした。

```
加重逃走罪［編集］
裁判の執行により拘禁された既決又は未決の者又は勾引状の執行を受けた者が拘禁場若しくは拘束のための器具を損壊し、暴行若しくは脅迫をし、又は二人以上通謀して、逃走したときは、3か月以上5年以下の懲役に処せられる（刑法第98条）。

［source：］逃走の罪 - Wikipedia https://ja.wikipedia.org/wiki/%E9%80%83%E8%B5%B0%E3%81%AE%E7%BD%AA
```

　単純逃走罪と勘違いしていたことに気が付きましたが，それでも3か月以上5年以下の懲役とあります。加重逃走罪が成立したらしいので，器具を損壊と認定されたようですが，アクリル板が壊れていたから逃げたという主張もあったのかもしれません。通常は物理的に不可能とも考えられます。

```
石塚教授によると、警察署の留置施設では、就寝時間に向けて点呼や検査に人員を割くため、夜間の面会室周辺は手薄になりやすい。

　一方、同署は、接見開始から約２時間たっても状況をチェックしていなかった。接見は通常３０分～１時間程度。ある警察官は「長いと感じれば、ノックして確認する。弁護士側のドアをたたけば接見妨害といわれることもない」と指摘。石塚教授は「一人でも接見終了を確認する態勢を整えていれば、逃走の隙を与えることはなかった」と話した。

［source：］【富田林脱走】「接見の自由」逆手に　「面会中は監視ＮＧ」の特性、逃走に影響（2/2ページ） - 産経ニュース https://www.sankei.com/west/news/180815/wst1808150057-n2.html
```

　探している情報がなかなか見つからないのですが，弁護士が接見の時間を2時間か1時間半と警察官に伝え，30分で終わったのに伝えなかったとなっていたはずです。

　金沢中警察署では当番弁護士と接見をしていましたが，短い時間でした。けっこう広い部屋だったと記憶にあるのですが，一般の面会は普通に狭く金沢刑務所の拘置所と同じぐらいだったと思います。拘置所も受刑者も面会室は同じだと思いますが，3人までとなっていたと思います。

　一般の面会は，警察署も刑務所も立ち会いがいます。平成11年の事件では拘置所も受刑中も同じ金沢刑務所でしたが，母親は一度も面会に来ませんでした。足が悪いので来れないという話でした。

　この富田林警察署の被疑者逃走事件の報道で見る接見室も，広く感じる接見室で，そういえばテレビのドラマで見る面会室もずいぶん広いものが多いです。金沢刑務所の面会室は，横幅がちょうど広めのトイレの個室に近かったかもしれません。

```
元東京地検検事の田中喜代重弁護士は、弁護士が署員に伝えず無言で接見室を立ち去ったことについて「本当なのか？　と思ってしまうぐらい、あり得ないこと」と驚きの声を上げた。

　まず弁護士の立場として「そもそも接見相手がなんと言おうと、１００％署員に声掛けをする」と断言した。接見には時間制限がなく、終了したことを伝えるのは、部屋を初めに出る弁護士しかいない。「小窓がついて署員がのぞける接見室もありますが、今回はなかったんですよね。署員が中の様子を知るすべが皆無なわけですから、なおさら弁護士自身が告げる必要がある」と対応に疑問を呈した。

　さらに「『署員に言わなくていい』『自分で伝える』と言われても『なぜその必要が？』と論理的に聞き返すのが弁護士というもの」と田中弁護士。「真に受けて言葉どおりに従うことなんて絶対ないはずなんですが…」と首をかしげていた。

［source：］樋田淳也容疑者逃走に田中喜代重弁護士、驚き「真に受けて言葉通りに従うなんて絶対ないはず」 ： スポーツ報知 https://hochi.news/articles/20180817-OHT1T50251.html
```

　踏み込んだ内容の上記の記事ですが，これにも接見の時間のことは書かれていないようです。なかなか見つからないと余計に気になってきました。

```
また、弁護士側の責任も大きいと言わざるを得ない。接見を済ませた後、容疑者一人を部屋に残したまま、平気で退去する神経が信じられない。

容疑者が「私が警察官に声をかけます」と言ったというが、容疑者を安易に信用せず、弁護士自身が、接見の終了を警察官に告げ、身柄を確実に引き渡したのを見届けてから退去するべきだろう。

［source：］大阪をザワつかせる「樋田容疑者逃走事件」はなぜ起きたか（原田 隆之） | 現代ビジネス | 講談社（1/4） https://gendai.ismedia.jp/articles/-/57260
```

富田林署　逃走　予定　弁護士 - Google 検索 https://t.co/hjNr1D0lwr

富田林署　逃走　30分　弁護士 - Google 検索 https://t.co/XEnwmpYU10

【富田林脱走】逃走は面会終了３０分以内か　複数の防犯カメラに似た男 - 産経ニュース https://t.co/kZRBnYqoUT 樋田淳也容疑者（３０）が、弁護士との接見終了から３０分以内に署の敷地外に出たとみられることが１５日、捜査関係者への取材で分かった。

【富田林脱走】逃走は面会終了３０分以内か　複数の防犯カメラに似た男 - 産経ニュース https://t.co/kZRBnYqoUT 捜査関係者によると、樋田容疑者は１２日午後７時半ごろから、同署２階の面会室で弁護士と接見。弁護士は同８時ごろに接見を終えて退出していた。

```
捜査関係者によると、弁護士との接見は１２日午後７時半ごろ始まり、８時ごろ終了。その約３０分後、署南側の道路の防犯カメラに、服装や体格が樋田容疑者とよく似た男が写っていた。署員が接見室に誰もいないのに気付いたのは、午後９時４５分ごろだった。

［source：］樋田容疑者、計画的？短時間で逃走…弁護士接見終了「署員に伝えないで」 - 芸能社会 - SANSPO.COM（サンスポ） https://www.sanspo.com/geino/news/20180818/tro18081805010001-n1.html
```

　私の2回の警察署の留置場生活の経験で，夜に弁護士の接見というのは一度もなかったと思います。一般の面会が夜にあったとも考えられないですが，夕食後は，取調べで留置場の外に出る被疑者もいなかったか，いても気が付きませんでした。私自身も夕食後の取調べはなかったような気がします。

　金沢西警察署では夕食後，夜の取調べも普通にありました。21時が消灯時間となっていたと思いますが，暗くなったところに戻った記憶はないのですが，取調べが続いた頃は3つの部屋の真ん中に一人だけでいて，前が留置係の机だったので，普通に電気がついていたような気がします。

　拘置所も刑務所も消灯時間になると，かなり灯りが落ちますが真っ暗にはなりません。通路からブレーカーが落ちるような大きな音がして，それとほぼ同時に暗くなりました。

　上記の記事によると，警察官は21時45分に接見室の中を初めて確認したことになります。接見の始まりは19時半とあるので，22時までの予定と警察官は弁護士に伝えられていた可能性が高そうです。22時の予定だと，これまでみたどの報道より長く，2時間半になります。

　この弁護士が絡んだ逃走事件の異様さは，その日が8月12日ということです。お盆休みは短くても13日から始まるものという経験があります。弁護士も予定があるだろうし，親身で熱心な刑事弁護にみえながら，30分の終了で，予定の変更を警察に伝えず帰ったというのは真夏の夜の怪奇譚のようです。

　弁護士が2時間接見をしてくれるというのも余り聞いた覚えがないですし，それもお盆休みに近い8月12日，警察官が確認に来た時間が21時45分というので，最低でも19時30分から21時45分という予定時間で接見を始めたことになりまｓ．早く終わったのも弁護士の都合とは考えにくいです。

```
捜査関係者によると、弁護士との接見は１２日午後７時半ごろ始まり、８時ごろ終了。その約３０分後、署南側の道路の防犯カメラに、服装や体格が樋田容疑者とよく似た男が写っていた。署員が接見室に誰もいないのに気付いたのは、午後９時４５分ごろだった。

［source：］樋田容疑者、計画的？短時間で逃走…弁護士接見終了「署員に伝えないで」 - 芸能社会 - SANSPO.COM（サンスポ） https://www.sanspo.com/geino/news/20180818/tro18081805010001-n1.html
```

　上記の記事には逃走の発覚が午後9時43分とあり，「時間制限はないが、弁護士の接見開始からは約２時間１５分が経過していた。」とあります。夜に警察署で弁護士の接見があるというのも，近年，弁護士のツイートで知っていたことではありますが，消灯時間と同じ21時までという感覚でした。

　ただ，私自身，金沢中警察署で23時ぐらいに留置場に戻ったことがありました。金沢地方検察庁の取調べの最後で，最後の調書が出来たという夜だったと思います。下平豪検事です。他にもベトナム人の複雑な事件で連日夜遅く取調べが続いていると，同行の警察官が話していました。

　どうも以前はよく見かけていたと記憶にある，弁護士の告げた接見の予定時間が一向に出てこないのですが，予定も告げられずに警察官が19時半から21時43分まで放置していたとは，とても考えられないことです。弁護士ならばなんでもなり，という感覚になってはいます。

```
さらに，本件では「声かけ」をしなかったことが問題になっています。
ですが，ここで説明した構造を思い出してみてください。拘置スペースと，それ以外は明確に分離されています。ですから，弁護士から拘置スペース側の職員に「声かけ」をすることは難しいのです。基本的に，被拘束者がドアを叩くなどして知らせます（押しボタンがある施設もあります。）。

［source：］接見室の構造と逃亡事件 ： 弁護士 深澤諭史のブログ http://xn--zqs94lv37b.club/archives/11404508.html
```

　記事の本文は読まないつもりでいたのですが，目を通しておこうかと思い読んだところ，以前読んだときには気が付かなかったようなことが書いてありました。「ここで説明した構造を思い出してみてください。拘置スペースと，それ以外は明確に分離されています。」とあります。

```
建物全体の構造としても，接見室の被拘束者のスペースを含む拘置スペースと，それ以外は明確に分離されています。私の知る限り，両方のスペースを繋ぐ扉は一つしか無く，非常に頑丈で厳重に封鎖されています。これも保安上，当然のことで，容易に想像ができることでしょう。

［source：］接見室の構造と逃亡事件 ： 弁護士 深澤諭史のブログ http://xn--zqs94lv37b.club/archives/11404508.html
```

　前後しますが，前の方には「建物全体の構造としても，接見室の被拘束者のスペースを含む拘置スペースと，それ以外は明確に分離されています。私の知る限り，両方のスペースを繋ぐ扉は一つしか無く非常に頑丈で厳重に封鎖されています。」とありました。

　平成4年当時の金沢西警察署は古い建物で，二階建ての二階の刑事課の広い部屋には，階段から上がってきて，左手に取調室。右手の奥に留置場の出入り口があって，直接見た覚えはないのですが，面会時の様子から，留置場の出入り口の右隣に，面会室の出入り口があったはずです。

　しかし，今考えると，これまで気が付かなかったのもどうかと思いますが，面会する人の誰もが刑事課の机の横を通行するのはおかしいので，たぶん一階から面会室に上がる階段があったものと推察されます。

　割と奥行きのある広い面会室でしたが，そういえば私の背後に警察官がいて，それが刑事課の部屋の近くでした。背後に机があって，警察官が後ろ向きで他の仕事をしていたようにも記憶にあります。他の面会では拘置所もそうですが，背後に椅子だけがあり，ぴたりと近くに刑務官がいました。

　平成9年の2月頃には，ほぼ同じ場所に金沢西警察署の新庁舎が出来上がり，通常の業務を行っていたので，平成4年は，取り壊し直前の建物だったようです。先日，強姦冤罪事件で全国的に知られた氷見警察署の前を通ったのですが，建物の古さが平成4年当時に見た金沢西警察署に近い気がしました。

　テレビで見る七尾警察署もずいぶん古い建物で，平成4年当時に存在した金沢西警察署の建物より前に出来たものにも思えていました。何ヶ月か前，テレビで建て替えのニュースをみたようにも思います。

　金沢西警察署の場合は，建物の老朽化というより，規模の拡張が目的であったとも考えられます。ここしばらくはテレビニュースで建物の映像をみていないですが，前の2階建ての建物とは比較にならない大きさで，5階以上はあると思います。

　そういえば前に，前の金沢西警察署の建物と，昭和61年の6月には別の場所にあった金沢中警察署の前の建物の写真をGoogleで探したのですが，どちらも見つからないということがありました。

金沢中警察署 - Google 検索 https://t.co/Pm15X59x1b

　金沢中警察署の建物は写真でみても新しくみえますが，それでも平成に入る前後に移転したとも思います。香林坊のアトリオ，大和百貨店の建物も同じぐらいかと思います。昨年あたり取り壊しで少し離れた場所に移転した宇出津の商工会の建物ですが，ずいぶん老朽化が進んでいました。

　昭和58年当時にはなかった建物と思うので，いつのまに出来たのか分かっていなかったのですが，金沢中警察署の移転とそう離れてはいなかった気がします。

　その現在の金沢中警察署の建物ですが，内部はかなり複雑な迷路のようになっていました。金沢には忍者寺というようなからくり屋敷の伝統もあるとテレビで聞きますが，留置場から面会室，取調室への経路が，そのようにややこしくなっていたのです。

　深澤諭史弁護士はブログで，警察署に拘置という言葉を使っていますが，私が法律の勉強などしていた全ての経験を踏まえても，拘置所という言葉以外に，拘置が出るのは，死刑に関する条文に，死刑の執行までの間，「監獄に拘置する」とあったのを見かけただけと思います。

　留置場という言葉は昭和50年台から見聞きしていたと思うのですが，当時はブタ箱と呼ばれることが多くありました。最近はほとんど見かけません。ネットでは2回ほど留置所というのを見かけたことがあるのですが，テレビや新聞でも見たことはないと思います。

　なお，金沢刑務所の場合，同じ敷地内にある拘置所は，その出入り口に「拘置舎」と書いてありました。これも他では見かけることがないのですが，たまたまなのか金沢刑務所での実体験になります。

　深澤諭史弁護士の記事の説明を読んでいると，まるで接見室の被疑者側の後ろのドアの向こうには，留置場があって留置係の警察官が常駐しているようなイメージを与えるもので，警察署や警察官の落ち度や不手際をより強く印象づけるものとなっています。

```
第11条
死刑は、刑事施設内において、絞首して執行する。
死刑の言渡しを受けた者は、その執行に至るまで刑事施設に拘置する。

［source：］刑法第11条 - Wikibooks https://ja.wikibooks.org/wiki/%E5%88%91%E6%B3%95%E7%AC%AC11%E6%9D%A1
```

　調べて確認をしましたが，刑法第11条とあります。こんな条文の前の方にあるとは思っていませんでした。私が勉強をしていた頃の記憶では，刑法の条文は260前後だったと思います。総則と各論に分かれていたかもしれません。大きく２つに分かれ，後ろの3分の2ぐらいが，刑罰の条文でした。

　以前は監獄法という法律があったのですが，それが変わったような話は見かけていました。それに合わせて刑法第11条の条文も改正されたのかと思います。

```
（死刑）
第十一条　死刑は、刑事施設内において、絞首して執行する。
２　死刑の言渡しを受けた者は、その執行に至るまで刑事施設に拘置する。

［source：］死刑関連法令・条文（現行法規・2007年11月11日時点） http://www.arsvi.com/d/c01321.htm
```

　上記の情報を見て，少し不安になったのですが，有斐閣平成8年度判例六法を引っ張り出して確認したところ，監獄となっていました。監獄という言葉も今は見かけなくなったので，知らない人もいるのかと考えたのですが，映画や漫画には出てきそうな気はします。

　テレビドラマでもそうだと思いますが，接見室の被疑者側の後ろのドアは，ドアの向こうが部屋に見ることはなく，通路に見えます。金沢中警察署も留置場と接見室の間は，通路があって，それも折れ曲がった通路になって，けっこう離れていたと思います。

　金沢中警察署の留置場は，入り口の手前が広い通路のような部屋になっていたような気もします。そこで最初に所持品を預けることになったのですが，安藤健次郎さんのPHSの番号を控えておきたいと，携帯電話を渡すのをしぶったり，そんなことがありました。広めのロッカー室というイメージですか。

　外から留置場に戻るときも，ややこしい部屋の中を通過した憶えがあります。あえてその部屋の中を通過する構造になっていたのか，今は思い出せることも少ないので，判然とはしませんが，接見室というのは，さらにその奥にあったはずです。

　時刻は16時59分です。今日は6時20分頃に目が覚め，パソコンを始めたのは7時30分ぐらいだったと思います。もう少し寝ておきたかったのですが眠れませんでした。先日もそうだったのですが，夜に暑くなると，クーラーがないのでなかなか眠れなくなってしまいます。

　今日も一日，深澤諭史弁護士のことに使ってしまった感があるのですが，この富田林警察署の被疑者逃走事件のことと，もう1つの脳機能障害の少女と弁護士のことは，欠かさず記録資料としてまとめておきたいとずっと前から考えていましたし，それが集中力の妨げともなっていました。

〈〈〈：Emacs： 2020-08-16（日曜日）17：05 　〈〈〈

